Revit 2027 API
DividedSurface.GetDividedSurfaceForReference Method
 Get a divided surface for a given reference. Returns null if the reference does not host a divided surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static DividedSurface GetDividedSurfaceForReference(
	Document document,
	Reference faceReference
)
Public Shared Function GetDividedSurfaceForReference (
	document As Document,
	faceReference As Reference
) As DividedSurface
public:
static DividedSurface^ GetDividedSurfaceForReference(
	Document^ document,
	Reference^ faceReference
)
static member GetDividedSurfaceForReference :
        document : Document *
        faceReference : Reference -> DividedSurface
Parameters
document Document
 The document.
faceReference Reference
 Reference that represents a face.
Return Value
DividedSurface
 The newly created divided surface.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DividedSurface Class
Autodesk.Revit.DB Namespace